s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 G�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 #:
J
 #+1:
J
 %+1�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 G�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2 
�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2 
�
bsl-language-serverMissingParameterDescription�Необходимо удалить описания параметров "Нет", отсутствующих в сигнатуре метода2
 #�
bsl-language-serverMissingParameterDescription�Необходимо удалить описания параметров "Нет", отсутствующих в сигнатуре метода2
 %