�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
� +1:
�$$ +1:
�:: +1:
�NN +1:
�WW /+1:
�dd +1p
bsl-language-serverFunctionShouldHaveReturn5Функция не содержит "Возврат"2:: p
bsl-language-serverFunctionShouldHaveReturn5Функция не содержит "Возврат"2WW /
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 P
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 ,
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"244 ,
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2II C�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "6" и используйте эту константу вместо магического числа.2 �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2$$ �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2$$ �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2:: �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2NN �
bsl-language-server
LineLength^Длина строки 151 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 124 превышает максимально допустимую 1202 |