�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :

 +1:

 +1:
$$
 +1�
bsl-language-serverCommentedCode�Программные модули не должны иметь закомментированных фрагментов кода2'' .�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2	
�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2!"�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2*+