�
bsl-language-serverCodeOutOfRegion/Переместите код в область2


 :
h


 +1:
h
 +1:
h00
 %+1�
bsl-language-serverAssignAliasFieldsInQuery�Полю "Контрагенты.ЭтоГруппа" не назначен псевдоним или пропущено ключевое слово КАК2  ' <�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2-- 
�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.222 R�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.233 �
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2	�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2