�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "ИЗ" написано не канонически2
�� �
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "ИЗ" написано не канонически2SS �
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 !:
9
 !+1:
9
 +1:
9-- '+1:
9:: !+1:
9HH
 +1:
9
��
 +1:
9
��
 +1:
9
��
 +1:
9
��
 +1�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 	�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "120" и используйте эту константу вместо магического числа.2
��> A�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "24" и используйте эту константу вместо магического числа.2
��O Q�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "60" и используйте эту константу вместо магического числа.2
��T V�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "60" и используйте эту константу вместо магического числа.2
��Y [�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "120" и используйте эту константу вместо магического числа.2
��F I�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "120" и используйте эту константу вместо магического числа.2
��V Y�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "120" и используйте эту константу вместо магического числа.2
�� �
bsl-language-serverNestedFunctionInParameters�Уберите инициализацию параметров метода "Добавить" вложенными методами2
�� �
bsl-language-serverNestedFunctionInParameters�Уберите инициализацию параметров метода "Добавить" вложенными методами2
�� �
bsl-language-serverNestedFunctionInParameters�Уберите инициализацию параметров метода "Добавить" вложенными методами2
�� �
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2		 !�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2PP !�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2
�� !�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2
�� !g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2t ug
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2^ _i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��7 8i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��8 9i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��9 :i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��: ;i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��; <i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��t ui
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��^ _i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��? @i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��@ Ai
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��A Bi
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��B Ci
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��C Di
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��H Ii
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��Q Ri
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��R Si
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��S Ti
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
�� i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
�� i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
�� i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
�� i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��P Qi
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��Q Ri
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��R Si
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��T Ui
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��U Vi
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��V Wi
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��t ui
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��^ _�
bsl-language-serverDeprecatedCurrentDatexИспользуйте "ТекущаяДатаСеанса" вместо устаревшего "ТекущаяДата"2
��- 8�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2h ~�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2R h�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
��+ B�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
��h ~�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
��R h�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
��3 J�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
��< Z�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
�� �
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
��h ~�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2
��R h�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2I J�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2
� ��
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2` a�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2UUC F�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2VVE H�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2WWE H�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2
��C F�
bsl-language-serverCommonModuleNameServerCalldДобавьте постфикс "ВызовСервера" к имени общего модуля2 	�
bsl-language-serverDuplicateStringLiteral�Необходимо избавиться от многократного использования строкового литерала "ПользовательБот"2rrQ b:0
.9rrQ b "ПользовательБот":0
.9vv* ; "ПользовательБот":2
09
�� , "ПользовательБот"�
bsl-language-server
LineLength^Длина строки 129 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 156 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 135 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 142 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 151 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 129 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 156 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 135 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 131 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 139 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 129 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 156 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 135 превышает максимально допустимую 1202	�� ��
bsl-language-serverIfConditionComplexityxВыделите условие оператора Если в отдельный метод или переменную2UX :