�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
0
 +1:
0 -+1:
0
 +1:
0
 +1:
0%%
 1+1:
0**
 :+1:
088
 +1�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2;<g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2		> ?g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2		? @g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2		@ A�
bsl-language-serverLatinAndCyrillicSymbolInWord�Нельзя использовать латинские и кириллические символы в одном идентификаторе2%%
 1�
bsl-language-serverLatinAndCyrillicSymbolInWord�Нельзя использовать латинские и кириллические символы в одном идентификаторе2**
 :