�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
@
 +1:
@ +1:
@LL +1:
@YY
 +1�
bsl-language-serverPairingBrokenTransaction�Отсутствует парный вызов "ОтменитьТранзакцию" для метода "НачатьТранзакцию"2bb �
bsl-language-serverBeginTransactionBeforeTryCatch�Метод 'НачатьТранзакцию' должен быть за пределами блока 'Попытка-Исключение' непосредственно перед оператором 'Попытка'2bb �
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2 
�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 N
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 B
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2HH N
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2VV N�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "9" и используйте эту константу вместо магического числа.2OO; <�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2 !�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2[[ !�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2LL �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2LL �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2YY
 g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2``G H�
bsl-language-server CommitTransactionOutsideTryCatch�Метод 'ЗафиксироватьТранзакцию' должен идти последним в блоке 'Попытка' перед оператором 'Исключение'2qq �
bsl-language-serverUnusedLocalVariablecУдалите неиспользуемую переменную ТипДанныхУдаления2++ �
bsl-language-serverCommonModuleNameServerCalldДобавьте постфикс "ВызовСервера" к имени общего модуля2 N