�
bsl-language-serverUsingSynchronousCalls�Вместо синхронного метода `КопироватьФайл` необходимо использовать `НачатьКопированиеФайла`2
�� 6�
bsl-language-serverMissedRequiredParameter_Укажите обязательный параметр 'СертификатыПодписи'2
�� (�
bsl-language-serverMissedRequiredParameter]Укажите обязательный параметр 'ВыгруженныеДанные'2
�� 6�
bsl-language-serverDeprecatedFindZИспользуйте "СтрНайти" вместо устаревшего "Найти"2
��
 �
bsl-language-server$NumberOfValuesInStructureConstructor�Уменьшите количество значений свойств, передаваемых в конструктор структуры2
�� P�
bsl-language-server$NumberOfValuesInStructureConstructor�Уменьшите количество значений свойств, передаваемых в конструктор структуры2
�� d�	
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
&
 +1:
&
 +1:
&
 +1:
&??
 +1:
&GG *+1:
&LL
 +1:
&XX
 +1:
&]]
 $+1:
&bb /+1:
&
��
 "+1:
&
��
 '+1:
&
�� 6+1:
&
��
 +1:
&
��
 +1:
&
��
 +1:
&
��
 +1:
&
��
 ++1:
&
��
 ++1:
&
��
 *+1:
&
�� B+1:
&
��
 +1:
&
�� "+1:
&
��
 2+1:
&
�� 0+1:
&
�� *+1:
&
��
 +1:
&
�� "+1:
&
��
 +1:
&
�� (+1:
&
��
 (+1:
&
�� 7+1:
&
��
 F+1:
&
�� 8+1:
&
�� +1:
&
��
 +1:
&
�� $+1:
&
��
 +1:
&
�� 9+1:
&
��
 +1:
&
�� .+1:
&
��
 )+1:
&
�� /+1:
&
�� !+1:
&
��
 +1:
&
�� +1:
&
��
 $+1:
&
��
 +1:
&
��
 +1:
&
�� +1:
&
��
 +1:
&
�� %+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ДанныеСертификатов метода ЗашифроватьНаСервере2
�� /:
&
�� "+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ФайлДвоичныеДанные метода ЗаписатьДанныеФайла2
�� 0:
&
�� +1:
&
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ЭЦПДвоичныеДанные метода ЗаписатьДанныеФайла2
��2 C:
&
�� +1:
&
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра АдресВременногоХранилища метода ПоместитьФайлОбъекта2
�� 7:
&yy +1:
&
�� +1:
&
�� +1`
bsl-language-serverTypo7Возможная опечатка в "Записат"2
�� B�
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2�� D�
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2�� 5�
bsl-language-serverTempFilesDirhНе рекомендуемый вызов функции КаталогВременныхФайлов()2 /�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� �
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� �
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� �
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� �
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "10" и используйте эту константу вместо магического числа.2
��F H�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "75" и используйте эту константу вместо магического числа.2
��; =�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "10" и используйте эту константу вместо магического числа.2
�� �
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "3" и используйте эту константу вместо магического числа.2
�� �
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "75" и используйте эту константу вместо магического числа.2
��; =�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "75" и используйте эту константу вместо магического числа.2
��; =�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "75" и используйте эту константу вместо магического числа.2
��; =�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "75" и используйте эту константу вместо магического числа.2
��; =�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2
�� !�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2
�� �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 $�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2jjg hg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2jjh ii
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��; <i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��< =i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��= >i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��> ?i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��? @i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��5 6i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��6 7i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��7 8i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��G Hi
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��H Ii
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��I Ji
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��= >i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��> ?�
bsl-language-serverMissingTemporaryFileDeletionrНужно добавить удаление временного файла после использования2
�� -|
bsl-language-serverMissingCodeTryCatchExBОтсутствует код в блоке "Исключение"2
�� �
bsl-language-serverDeprecatedCurrentDatexИспользуйте "ТекущаяДатаСеанса" вместо устаревшего "ТекущаяДата"2
��6 A�
bsl-language-serverDeprecatedCurrentDatexИспользуйте "ТекущаяДатаСеанса" вместо устаревшего "ТекущаяДата"2
��' 2�
bsl-language-serverGetFormMethodbНе рекомендуемое использование метода ПолучитьФорму2
�� (�
bsl-language-serverGetFormMethodbНе рекомендуемое использование метода ПолучитьФорму2
�� (�
bsl-language-serverGetFormMethodbНе рекомендуемое использование метода ПолучитьФорму2
�� (�
bsl-language-serverGetFormMethodbНе рекомендуемое использование метода ПолучитьФорму2
�� �
bsl-language-server
LineLength^Длина строки 132 превышает максимально допустимую 1202jj ��
bsl-language-server
LineLength^Длина строки 127 превышает максимально допустимую 1202tt �
bsl-language-server
LineLength^Длина строки 128 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 133 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 122 превышает максимально допустимую 1202�� z