s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 	�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 -:
=
 -+1:
=
 '+1�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 	�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-server!DuplicatedInsertionIntoCollection�Проверьте повторную вставку НСтр("ru = 'Введите '") в коллекцию ОписаниеГлобальногоПоискаМассив2

 B:
= B+1:
=

 B+1:
= B+1:
=

 B+1:
= B+1g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2W Xg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2X Yg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2[ \g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2\ ]g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2Z [g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2[ \�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2K `�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2O d�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2N c�
bsl-language-serverDuplicateStringLiteral�Необходимо избавиться от многократного использования строкового литерала "ru = 'Введите '"2/ @:(
&=/ @"ru = 'Введите '":(
&=

/ @"ru = 'Введите '":(
&=/ @"ru = 'Введите '"�
bsl-language-server
LineLength^Длина строки 132 превышает максимально допустимую 1202 �