s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 	�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически2 u
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 ):
:
 )+1�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 	�
bsl-language-serverGetFormMethodbНе рекомендуемое использование метода ПолучитьФорму2  