�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 .:
(
 .+1:
(((
 +1:
(55
 $+1:
(OO
 *+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ТипОС метода СохранитьПараметрыПодключенияСканера2/ 4:
(FF &+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ВыбранныеПараметры метода СохранитьПараметрыПодключенияСканера26 H:
(FF &+1d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2HH  Bd
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2OO
 *�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2 
�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2DD 
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 ?
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2		 K�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2((
 g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2C Dg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2D Eg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2A Bg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2B Cg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2//( )g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2//) *g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2//* +g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2//+ ,�
bsl-language-serverCommandModuleExportMethods�Не следует размещать экспортные методы в модулях команд и общих команд255
 $�
bsl-language-serverCommandModuleExportMethods�Не следует размещать экспортные методы в модулях команд и общих команд2OO
 *