�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
r +1:
r## +1:
r>>  +1:
rLL +1:
rdd
 &+1:
r
�� !+1:
r
��
 #+1:
r
�� #+1:
r
��
 -+1:
r
��
 !+1:
r
��
  +1:
r
��
 +1:
r
��
  +1:
r
��
 &+1:
r
��
 !+1:
r
��
 +1:
r
��
 +1:
r
��
 +1:
r
��
 #+1:
r
��
 !+1:
r
��
 +1:
r
��
 +1:
r
��
 +1:
r
��
 +1:
r
��
 +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Дата метода ПолучитьЦенуТовара2## :
r
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Товар метода ПолучитьЦенуТовара2##! &:
r
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ВидЦен метода ПолучитьЦенуТовара2##( .:
r
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Покупатель метода ПолучитьВидЦенПокупателя2>>! +:
r
��
 "+1:
r
�� #+1�
bsl-language-server,TransferringParametersBetweenClientAndServer{Установите модификатор "Знач" для параметра Товар метода ЭтоУслуга2LL :
r
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ПересчитатьДляВсехТоваров метода ПересчитатьЦеныИСуммыТоваров2dd' @:
r
�� +1:
r
�� +1:
r
��  +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра АдресТоваровВХранилище метода ПолучитьТоварыИзХранилища2
��$ ::
r
�� +1�
bsl-language-serverAssignAliasFieldsInQuery}Полю "ВидЦен" не назначен псевдоним или пропущено ключевое слово КАК2@@ �
bsl-language-serverAssignAliasFieldsInQuery�Полю "ЦеныТоваровСрезПоследних.Цена" не назначен псевдоним или пропущено ключевое слово КАК2hh /�
bsl-language-serverAssignAliasFieldsInQuery�Полю "ЦеныТоваровСрезПоследних.Товар" не назначен псевдоним или пропущено ключевое слово КАК2ii 0
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 8
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 J
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 2
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"255 <�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2,.�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2QS�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2z{�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2LL �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2
�� !�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2LL �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 #�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 -i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��? @t
bsl-language-serverMissingVariablesDescription6Добавьте описание переменной2 �
bsl-language-server
LineLength^Длина строки 129 превышает максимально допустимую 1202	�� �