�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
m
 +1:
m55
 +1:
mKK
 %+1�
bsl-language-serverAssignAliasFieldsInQuery�Полю "Контрагенты.ЭтоГруппа" не назначен псевдоним или пропущено ключевое слово КАК2::' <�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2MM R�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2NN �
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2!"�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2./�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки212�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2IJ�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2TU�
bsl-language-serverDuplicateStringLiteral�Необходимо избавиться от многократного использования строкового литерала "Сумма"2## &:
m## &"Сумма":
m**  '"Сумма":
m,,  '"Сумма"