�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 !:
 !+1:
{{
  +1�
bsl-language-serverCommentedCode�Программные модули не должны иметь закомментированных фрагментов кода2OR 4�
bsl-language-serverCommentedCode�Программные модули не должны иметь закомментированных фрагментов кода2WX !d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2 Nd
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2 Nd
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2 Ld
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2 Lb
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2 !b
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2P cb
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2P cb
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2N ab
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2N ab
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2 4b
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2{{
  b
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2~~* @d
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2
�� �
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "13" и используйте эту константу вместо магического числа.2UU8 :�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "10" и используйте эту константу вместо магического числа.2aa7 9�
bsl-language-serverRedundantAccessToObject�Избавьтесь от избыточного обращения внутри модуля через его имя или псевдоним ЭтотОбъект2[[ $�
bsl-language-serverMissingReturnedValueDescriptioneУдалите описание возвращаемого значения для процедуры2{{
  �
bsl-language-serverMissingParameterDescription�Необходимо удалить описания параметров "Нет", отсутствующих в сигнатуре метода2 !�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2{{
  g
bsl-language-serverMissingSpace8Справа от '-' не хватает пробела244, -�
bsl-language-serverDuplicateStringLiteral�Необходимо избавиться от многократного использования строкового литерала "КартинкаШтрихкода"2P c:4
2P c$"КартинкаШтрихкода":4
2P c$"КартинкаШтрихкода":4
2N a$"КартинкаШтрихкода":4
2N a$"КартинкаШтрихкода"�
bsl-language-server
LineLength^Длина строки 130 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 130 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 128 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 128 превышает максимально допустимую 1202 �