�
bsl-language-serverDeprecatedFindZИспользуйте "СтрНайти" вместо устаревшего "Найти"2	 �
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически222 �
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 1:

 1+1:
 +1:
++
 &+1:
GG
 +1:
OO +1:
[[ %+1:
yy
 +1:

��
 +1:

��
 @+1:

�� 3+1:

��
 ?+1:

��
 +1:

�� ++1:

��
 +1:

��
 +1:

��
 +1:

��
 +1:

��
 +1:

�� A+1:

��
 +1:

��  +1:

��
 +1:

��
 ++1:

��
 +1:

��
 +1:

�� -+1:

�� '+1:

��
 #+1:

�� 8+1:

�� %+1:

�� N+1:

�� !+1:

�� -+1:

�� +1:

�� C+1:

��
 &+1:

��
 +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ДанныеАдреса метода ИспользоватьТекущееМестоположениеСервер22 >:

�� *+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ДанныеМестоположения метода ИспользоватьТекущееМестоположениеСервер2@ T:

�� *+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Данные метода СоздатьНовыйФайлСервер2 %:
RR
  +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Расширение метода СоздатьНовыйФайлСервер2' 1:
RR
  +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Тип метода СоздатьНовыйФайлСервер23 6:
RR
  +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ДанныеКонтакта метода ЗаполнитьИзКонтактаНаСервере2++' 5:

�� +1�
bsl-language-serverUsingThisForm�Вместо устаревшего свойства "ЭтаФорма" следует использовать "ЭтотОбъект"2
�� 
�
bsl-language-serverUsingThisForm�Вместо устаревшего свойства "ЭтаФорма" следует использовать "ЭтотОбъект"2
�� 
h
bsl-language-serverTypo?Возможная опечатка в "Возомжность"2
�� 8h
bsl-language-serverTypo?Возможная опечатка в "Видеозвонок"2
�� �
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� �
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2vw�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "2" и используйте эту константу вместо магического числа.2
�� �
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "2" и используйте эту константу вместо магического числа.2
�� �
bsl-language-serverNestedFunctionInParameters�Уберите инициализацию параметров конструктора "ЗапускПриложенияМобильногоУстройства" вложенными методами2
�� 4�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2
�� !�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2
�� !�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения200Y Z�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� 
g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2RRK Lg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2RRm ng
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2cc) *g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2dd) *g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2ee( )g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2ff( )g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2gg& 'g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2hh) *i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��< =i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��= >i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��> ?i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��? @i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��@ Ai
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��" #i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��" #�
bsl-language-serverDeprecatedCurrentDatexИспользуйте "ТекущаяДатаСеанса" вместо устаревшего "ТекущаяДата"2& 1�
bsl-language-serverDeprecatedCurrentDatexИспользуйте "ТекущаяДатаСеанса" вместо устаревшего "ТекущаяДата"2; F�
bsl-language-serverDeprecatedCurrentDatexИспользуйте "ТекущаяДатаСеанса" вместо устаревшего "ТекущаяДата"2
��' 2�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2
��  !�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2
��+ ,�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2
��  !�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2
��' (�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2
��+ ,�
bsl-language-server
LineLength^Длина строки 144 превышает максимально допустимую 1202RR ��
bsl-language-server
LineLength^Длина строки 131 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 189 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 193 превышает максимально допустимую 1202	�� ��
bsl-language-serverIfConditionComplexityxВыделите условие оператора Если в отдельный метод или переменную2
�� /