�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
n +1:
n22 #+1:
n::  +1:
nGG +1:
nrr
 !+1:
n{{
  +1:
n
��
 &+1:
n
��
 +1:
n
��
 !+1:
n
��
 +1:
n
��
 +1:
n
��
 +1:
n
��
 +1p
bsl-language-serverFunctionShouldHaveReturn5Функция не содержит "Возврат"2GG �
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Дата метода ПолучитьЦенуТовара2 :
nWW #+1:
nuu +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Товар метода ПолучитьЦенуТовара2! &:
nWW #+1:
nuu +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Штрихкод метода ПолучитьТоварПоШтрихкоду2::! ):
n
�� #+1d
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2
�� "
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 7
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 I�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки256�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2?C�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2HI�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2QR�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2XY�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2[\�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2de�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2gi�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2op�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2
�� !�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� 
�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2 