�
bsl-language-serverCanonicalSpellingKeywordsSКлючевое слово "цикл" написано не канонически2
��8 <�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически2 �
bsl-language-serverCodeOutOfRegion/Переместите код в область2		  :
p		  +1:
p  
 +1:
pvv
 +1:
p
��
 +1:
p
��
 %+1:
p
��
 +1�
bsl-language-serverAssignAliasFieldsInQuery�Полю "ТребуетсяТовара.Товар" не назначен псевдоним или пропущено ключевое слово КАК2
��& ;�
bsl-language-serverAssignAliasFieldsInQuery�Полю "Контрагенты.ЭтоГруппа" не назначен псевдоним или пропущено ключевое слово КАК2
��' <�
bsl-language-serverAssignAliasFieldsInQuery�Полю "Контрагенты.ВидЦен" не назначен псевдоним или пропущено ключевое слово КАК2
��' 9�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2
�� 
�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2
�� �
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2
�� /�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2
�� R�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2
�� �
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2
�� M�
bsl-language-serverExtraCommas�Не используйте запятые для параметров по умолчанию в конце вызова метода.2EEw x�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2#$�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2QR�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2Z[�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2cd�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2mn�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2		  �
bsl-language-serverMissingReturnedValueDescriptioneУдалите описание возвращаемого значения для процедуры2vv
 �
bsl-language-serverMissingParameterDescription�Необходимо удалить описания параметров "Нет.", отсутствующих в сигнатуре метода2vv
 g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2AAm ng
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2EEv wg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2EEw xg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2HHm n�
bsl-language-serverStyleElementConstructorsfЗамените конструктор Шрифт на получение элемента стиля2DD R�
bsl-language-serverJoinWithVirtualTablepНе следует использовать соединения с виртуальными таблицами2
��# /�
bsl-language-serverDuplicateStringLiteral�Необходимо избавиться от многократного использования строкового литерала "Сумма"2
�� &:
p
�� &"Сумма":
p
��  '"Сумма":
p
��  '"Сумма"�
bsl-language-server
LineLength^Длина строки 123 превышает максимально допустимую 1202EE {