�
bsl-language-server
RefOveruseWИзбавьтесь от получения поля "Ссылка" в запросе.2'' �
bsl-language-server
RefOveruseWИзбавьтесь от получения поля "Ссылка" в запросе.233 �
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
< +1:
< +1s
bsl-language-serverCompilationDirectiveNeedLess6Удалите директиву компиляции2 
s
bsl-language-serverCompilationDirectiveNeedLess6Удалите директиву компиляции2 
w
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2			, �v
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2 2�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 R�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2 �
bsl-language-serverCommonModuleNameServerCalldДобавьте постфикс "ВызовСервера" к имени общего модуля2 R�
bsl-language-server
LineLength^Длина строки 175 превышает максимально допустимую 1202		 ��
bsl-language-server
LineLength^Длина строки 133 превышает максимально допустимую 1202 �