�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
W
 +1:
W
 +1�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2 $�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2 ,�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
 