�
bsl-language-serverCanonicalSpellingKeywordsSКлючевое слово "если" написано не канонически2
�� �
bsl-language-serverCanonicalSpellingKeywordsUКлючевое слово "тогда" написано не канонически2
��  �
bsl-language-serverCanonicalSpellingKeywordsYКлючевое слово "возврат" написано не канонически2
�� 	�
bsl-language-serverCanonicalSpellingKeywords]Ключевое слово "конецЕсли" написано не канонически2
�� 
�
bsl-language-serverCanonicalSpellingKeywordsYКлючевое слово "экспорт" написано не канонически2
��V ]�
bsl-language-serverCanonicalSpellingKeywordscКлючевое слово "конецпопытки" написано не канонически2
�� �
bsl-language-serverCanonicalSpellingKeywords_Ключевое слово "исключение" написано не канонически2
�� �
bsl-language-serverCanonicalSpellingKeywordsUКлючевое слово "тогда" написано не канонически2
��4 9�
bsl-language-serverCanonicalSpellingKeywordsYКлючевое слово "попытка" написано не канонически2
�� �
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 ":
6
 "+1:
6 +1:
6--  +1:
6FF +1:
6UU
 $+1:
6]]
 +1:
6ee
 +1:
6nn
 &+1:
6ww
 +1:
6
��
 +1:
6
�� 7+1:
6
��
 +1:
6
��
 +1p
bsl-language-serverFunctionShouldHaveReturn5Функция не содержит "Возврат"2FF �
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ШтрихКод метода ДобавитьТоварПоШтрихКоду2--! ):
6
�� %+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ТекстЗаписи метода ДобавитьТоварПоNDEF2FF ':
6
�� +1�
bsl-language-serverUsingThisForm�Вместо устаревшего свойства "ЭтаФорма" следует использовать "ЭтотОбъект"2zzF N�
bsl-language-serverAssignAliasFieldsInQuery�Полю "Товары.Ссылка" не назначен псевдоним или пропущено ключевое слово КАК211 �
bsl-language-serverAssignAliasFieldsInQuery�Полю "Товары.Наименование" не назначен псевдоним или пропущено ключевое слово КАК222 %b
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2zz0 Dd
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2
��
 
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 �
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2
�� 
�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2 �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2--  �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2FF �
bsl-language-serverMissingParameterDescriptionVНеобходимо добавить описание параметра "Товар"2 #�
bsl-language-serverMissingParameterDescription\Необходимо добавить описание параметра "Элементы"2% -�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2--  �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2FF g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2||  !g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2||! "�
bsl-language-serverLatinAndCyrillicSymbolInWord�Нельзя использовать латинские и кириллические символы в одном идентификаторе2
��
 