u
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 (:

 (+1�
bsl-language-serverAssignAliasFieldsInQuery�Полю "Склады.Ссылка" не назначен псевдоним или пропущено ключевое слово КАК2 �
bsl-language-serverAssignAliasFieldsInQuery�Полю "Склады.Наименование" не назначен псевдоним или пропущено ключевое слово КАК2 �
bsl-language-serverAssignAliasFieldsInQuery�Полю "Склады.НеИспользовать" не назначен псевдоним или пропущено ключевое слово КАК2 �
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2

 '�
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2 �
bsl-language-serverSpaceAtStartComment�Между символами комментария '//' и самим текстом комментария должен быть пробел.2)) .�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
 (