�
bsl-language-serverUsingSynchronousCalls�Вместо синхронного метода `Предупреждение` необходимо использовать `ПоказатьПредупреждение`2
�� �
bsl-language-serverUsingSynchronousCalls�Вместо синхронного метода `ОткрытьЗначение` необходимо использовать `ПоказатьЗначение`2
��
 #�
bsl-language-serverCanonicalSpellingKeywordsYКлючевое слово "возврат" написано не канонически2 
�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
~ +1:
~
 +1:
~,,
 +1:
~OO
 +1:
~dd +1:
~~~
 +1:
~
��
 +1:
~
��
 +1:
~
��
 "+1:
~
��
 +1:
~
��
 (+1�
bsl-language-serverCompilationDirectiveLostuУкажите директиву компиляции у метода "ПолучитьОтборДляОтчета"2 �
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра НовоеНастройки метода ПриИзмененииНастроек2OO -:
~
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра НовоеОбновлятьПриОбмене метода ПриИзмененииНастроек2OO/ F:
~
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ТекстОшибки метода ПолучитьОтчет2dd !:
~
�� +1�
bsl-language-serverUsingModalWindows�Вместо модального метода `Предупреждение` необходимо использовать `ПоказатьПредупреждение`2
�� �
bsl-language-serverUsingModalWindows�Вместо модального метода `ОткрытьЗначение` необходимо использовать `ПоказатьЗначение`2
��
 #�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� 
�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2dd �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2OO
 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2dd �
bsl-language-serverGetFormMethodbНе рекомендуемое использование метода ПолучитьФорму2
�� 