�
bsl-language-serverDeprecatedFindZИспользуйте "СтрНайти" вместо устаревшего "Найти"2ZZ �
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 &:
`
 &+1:
`
 +1:
`** (+1:
`>>
 +1:
`II
 +1:
`TT
 +1:
`kk
 +1:
`ss
 +1:
`xx $+1:
`
��
 +1:
`
�� !+1:
`
��
 +1:
`
��
 +1:
`
��
 "+1:
`
��
 +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ПользователиПриемник метода СкопироватьНаСервере2>> 3:
`
�� +1i
bsl-language-serverTypo?Возможная опечатка в "скопируются"2�� ��
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2** (�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2>>
 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 "�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 �
bsl-language-serverFormDataToValuepНе рекомендуемое использование метода ДанныеФормыВЗначение2 !�
bsl-language-serverFormDataToValuepНе рекомендуемое использование метода ДанныеФормыВЗначение2BB !�
bsl-language-serverFormDataToValuepНе рекомендуемое использование метода ДанныеФормыВЗначение2MM !�
bsl-language-server
LineLength^Длина строки 130 превышает максимально допустимую 120222 ��
bsl-language-server
LineLength^Длина строки 129 превышает максимально допустимую 1202\\ ��
bsl-language-server
LineLength^Длина строки 169 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 138 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 192 превышает максимально допустимую 1202	�� �