�
bsl-language-serverDeprecatedMethods8317�Метод "ПоказатьИнформациюОбОшибке" устарел. Следует использовать одноименный метод объекта типа МенеджерОбработкиОшибок2--	 #s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 �
bsl-language-serverCodeOutOfRegion/Переместите код в область2 $:
M $+1:
M
 4+1�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 �
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2)) �
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "4" и используйте эту константу вместо магического числа.2a b�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2// 
�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2.. �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2** 