�
bsl-language-serverExportVariables�Не рекомендуется использовать экспортные переменные. Это может стать источником трудновоспроизводимых ошибок2		 &q
bsl-language-serverCodeOutOfRegion/Переместите код в область2		 ':
u		 '+1d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2		 �
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2
