�
bsl-language-serverCodeOutOfRegion/Переместите код в область2		
 :
f		
 +1:
f!!
 +1�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2"#�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2)*�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2,-�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2		
 �
bsl-language-serverDataExchangeLoading�Добавьте проверку признака ОбменДанными.Загрузка в самом начале процедуры2!!
 