�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически2
�� �
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
e +1:
e## +1:
e>>  +1:
eLL +1:
edd
 &+1:
e
�� !+1:
e
��
 #+1:
e
�� #+1:
e
��
 -+1:
e
�� +1:
e
��
 !+1:
e
��
  +1:
e
��
 +1:
e
��
  +1:
e
��
 &+1:
e
��
 !+1:
e
��
 +1:
e
��
 !+1:
e
��
 +1:
e
��
 +1:
e
��
 +1:
e
��
 +1:
e
��
 +1:
e
��
 +1:
e
��
 +1:
e
��
 +1:
e
��
 5+1:
e
��
 /+1:
e
�� &+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Дата метода ПолучитьЦенуТовара2## :
e
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Товар метода ПолучитьЦенуТовара2##! &:
e
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ВидЦен метода ПолучитьЦенуТовара2##( .:
e
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Покупатель метода ПолучитьВидЦенПокупателя2>>! +:
e
��
 "+1:
e
�� #+1�
bsl-language-server,TransferringParametersBetweenClientAndServer{Установите модификатор "Знач" для параметра Товар метода ЭтоУслуга2LL :
e
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ПересчитатьДляВсехТоваров метода ПересчитатьЦеныИСуммыТоваров2dd' @:
e
�� +1:
e
�� +1:
e
��  +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра АдресТоваровВХранилище метода ПолучитьТоварыИзХранилища2
��$ ::
e
�� +1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Покупатель метода ПолучитьТелефон2
�� ":
e
�� +1:
e
�� +1�
bsl-language-serverUsingThisForm�Вместо устаревшего свойства "ЭтаФорма" следует использовать "ЭтотОбъект"2
��  �
bsl-language-serverAssignAliasFieldsInQuery}Полю "ВидЦен" не назначен псевдоним или пропущено ключевое слово КАК2@@ �
bsl-language-serverAssignAliasFieldsInQuery�Полю "ЦеныТоваровСрезПоследних.Цена" не назначен псевдоним или пропущено ключевое слово КАК2hh	 &�
bsl-language-serverAssignAliasFieldsInQuery�Полю "ЦеныТоваровСрезПоследних.Товар" не назначен псевдоним или пропущено ключевое слово КАК2ii	 '
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 8
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 J
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 2
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"255 <�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2,.�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2QS�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2z{�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� 
�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� 
�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2
�� �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2LL �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2
�� !�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2
�� �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2LL �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 #�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
��
 -�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
�� i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��? @i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��! "i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��v wi
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��! "i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��! "t
bsl-language-serverMissingVariablesDescription6Добавьте описание переменной2 �
bsl-language-server
LineLength^Длина строки 129 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 159 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 127 превышает максимально допустимую 1202�� �
bsl-language-server
LineLength^Длина строки 158 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 141 превышает максимально допустимую 1202	�� ��
bsl-language-server
LineLength^Длина строки 132 превышает максимально допустимую 1202	�� �