u
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
	
 +1�
bsl-language-serverWrongDataPathForFormElements�Не указан путь к данным у реквизита формы "Календарь". Форма "Справочник.Встречи.Форма.ФормаСписка".2 �
bsl-language-serverWrongDataPathForFormElements�Не указан путь к данным у реквизита формы "Источник". Форма "Справочник.Встречи.Форма.ФормаСписка".2 �
bsl-language-serverWrongDataPathForFormElements�Не указан путь к данным у реквизита формы "Подсказка". Форма "Справочник.Встречи.Форма.ФормаСписка".2 �
bsl-language-server
LineLength^Длина строки 124 превышает максимально допустимую 1202 |