�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "не" написано не канонически2}} 	�
bsl-language-serverCanonicalSpellingKeywordsMКлючевое слово "и" написано не канонически2}}7 8�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "не" написано не канонически2
�� 	�
bsl-language-serverCanonicalSpellingKeywordsMКлючевое слово "и" написано не канонически2
��- .�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "не" написано не канонически2zz 	�
bsl-language-serverCanonicalSpellingKeywordsMКлючевое слово "и" написано не канонически2zz0 1�
bsl-language-serverCanonicalSpellingKeywordsSКлючевое слово "цикл" написано не канонически2vv! %�
bsl-language-serverCanonicalSpellingKeywordsMКлючевое слово "и" написано не канонически2ww& '�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически2vv �
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
2
 +1:
2
 !+1:
2..
 +1:
2>>
 +1:
2EE
 3+1:
2LL
 :+1:
2SS
 A+1:
2ZZ
 7+1:
2aa
 E+1:
2ii
 0+1:
2pp
 0+1:
2
��
 A+1:
2
��
 :+1:
2
��
 ;+1v
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2. vw
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2	/ �w
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2	4 �v
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2aa
 Ev
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирование"277 .�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2 �
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2���
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2��g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела277. /�
bsl-language-server
LineLength^Длина строки 125 превышает максимально допустимую 1202 }�
bsl-language-server
LineLength^Длина строки 135 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 135 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 177 превышает максимально допустимую 120244 �