�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 ,:
I ,+1:
I +1:
I%%
 !+1:
I,, 0+1:
I44
 3+1:
I;; -+1:
ICC
 0+1:
IJJ 4+1:
IRR
 7+1�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2 
�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 H
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2 >�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2 ,�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2 �
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2,, 0�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2;; -�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2JJ 4�
bsl-language-serverAllFunctionPathMustHaveReturn^Не все пути выполнения функции возвращают значение2 ,:n
lI ,^Не все пути выполнения функции возвращают значение:n
lI 
^Не все пути выполнения функции возвращают значение�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2%%
 !�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода244
 3�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2CC
 0�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2RR
 7g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2''> ?g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2''? @�
bsl-language-serverCommonModuleNameServerCalldДобавьте постфикс "ВызовСервера" к имени общего модуля2 H