u
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
|
 +1�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-server(NestedConstructorsInStructureDeclaration}Не используйте конструкторы с параметрами при объявлении структуры2	 �:A
?|	 �0Конструктор с параметрами:A
?|	_ �0Конструктор с параметрами�
bsl-language-server
LineLength^Длина строки 165 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 180 превышает максимально допустимую 1202 �