s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 R�
bsl-language-serverCanonicalSpellingKeywordsSКлючевое слово "цикл" написано не канонически244' +�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически244 �
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически2-- �
bsl-language-serverCanonicalSpellingKeywordsSКлючевое слово "цикл" написано не канонически2--' +�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
; +1:
;%%
 +1:
;FF +1:
;\\
 +1:
;dd %+1:
;mm 
+1s
bsl-language-serverCompilationDirectiveNeedLess6Удалите директиву компиляции2 
s
bsl-language-serverCompilationDirectiveNeedLess6Удалите директиву компиляции2$$ 
s
bsl-language-serverCompilationDirectiveNeedLess6Удалите директиву компиляции2EE 
v
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2. v
bsl-language-serverTypoOВозможная опечатка в "Геопозиционирования"2

3 ^
bsl-language-serverTypo7Возможная опечатка в "Геозоны"2%%
 ^
bsl-language-serverTypo7Возможная опечатка в "Геозоны"2,, ^
bsl-language-serverTypo7Возможная опечатка в "Геозоны"2hh& 5v
bsl-language-serverTypoOВозможная опечатка в "геопозиционирования"2 Kv
bsl-language-serverTypoOВозможная опечатка в "геопозиционирования"2 jv
bsl-language-serverTypoOВозможная опечатка в "геопозиционирования"2OO }�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 R�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "300" и используйте эту константу вместо магического числа.2
..� ��
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "60" и используйте эту константу вместо магического числа.2MMK M�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2aa 
�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2FF g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2ff/ 0g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2ii> ?g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2ii? @�
bsl-language-server
LineLength^Длина строки 134 превышает максимально допустимую 1202 ��
bsl-language-server
LineLength^Длина строки 134 превышает максимально допустимую 1202

 ��
bsl-language-server
LineLength^Длина строки 147 превышает максимально допустимую 1202.. ��
bsl-language-server
LineLength^Длина строки 167 превышает максимально допустимую 1202MM ��
bsl-language-server
LineLength^Длина строки 133 превышает максимально допустимую 1202OO ��
bsl-language-server
LineLength^Длина строки 144 превышает максимально допустимую 1202ee �