�
bsl-language-serverCodeOutOfRegion/Переместите код в область2		 ?:
R		 ?+1:
R 0+1�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2 
�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2)) 
�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2		 ?�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2 0�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2		 ?�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2 0