s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 >�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 0:
E
 0+1:
E


 -+1:
E
 6+1�
bsl-language-serverCommonModuleNameFullAccessbДобавьте постфикс "ПолныеПрава" к имени общего модуля2 >�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 >�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2