�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
a
 +1:
a


 !+1:
a
 +1:
a
 !+1:
a""
 !+1:
a@@
 /+1:
aJJ
 2+1:
aYY
 +1:
a^^
 +1:
acc
 "+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра Разрешен метода УстановитьПолнотекстовыйПоискРазрешен2@@0 8:
aLL '+1�
bsl-language-serverServerSideExportFormMethodhЗапрещено создавать серверные экспортные методы в форме2
 �
bsl-language-serverServerSideExportFormMethodhЗапрещено создавать серверные экспортные методы в форме2@@
 /�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2<=�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2@@
 /�
bsl-language-server
LineLength^Длина строки 128 превышает максимально допустимую 1202'' ��
bsl-language-server
LineLength^Длина строки 146 превышает максимально допустимую 120200 ��
bsl-language-server
LineLength^Длина строки 142 превышает максимально допустимую 120222 ��
bsl-language-server
LineLength^Длина строки 128 превышает максимально допустимую 1202SS ��
bsl-language-server
LineLength^Длина строки 154 превышает максимально допустимую 1202jj �