�
bsl-language-serverCanonicalSpellingKeywordsYКлючевое слово "попытка" написано не канонически2 �
bsl-language-serverCanonicalSpellingKeywordsUКлючевое слово "тогда" написано не канонически2  �
bsl-language-serverCanonicalSpellingKeywordsYКлючевое слово "возврат" написано не канонически2 	�
bsl-language-serverCanonicalSpellingKeywords]Ключевое слово "конецЕсли" написано не канонически2 
�
bsl-language-serverCanonicalSpellingKeywordsSКлючевое слово "если" написано не канонически2 �
bsl-language-serverCanonicalSpellingKeywords_Ключевое слово "исключение" написано не канонически2   �
bsl-language-serverCanonicalSpellingKeywordscКлючевое слово "конецпопытки" написано не канонически2"" �
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :

 +1:
 6+1�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2 
�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2!! 
�
bsl-language-serverCommandModuleExportMethods�Не следует размещать экспортные методы в модулях команд и общих команд2 6�
bsl-language-server
LineLength^Длина строки 126 превышает максимально допустимую 1202 ~