s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 Q�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 ,:
H
 ,+1:
H =+1:
H==
 ++1:
HDD 4+1:
HOO +1s
bsl-language-serverCompilationDirectiveNeedLess6Удалите директиву компиляции2 
s
bsl-language-serverCompilationDirectiveNeedLess6Удалите директиву компиляции2CC 
d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2
 ,d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2 =d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2@ ed
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2## d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2==
 +d
bsl-language-serverTypo=Возможная опечатка в "Штрихкодов"2DD 4b
bsl-language-serverTypo;Возможная опечатка в "Штрихкода"2++: K�
bsl-language-serverIfElseIfEndsWithElse�Синтаксическая конструкция вида "Если...Тогда...ИначеЕсли..." должна содержать ветвь "Иначе".2[[ 
�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 Q�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2@@ 
�
bsl-language-serverMissingReturnedValueDescriptioneУдалите описание возвращаемого значения для процедуры2
 ,�
bsl-language-serverMissingReturnedValueDescription\Добавьте описание возвращаемого значения функции2OO �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2==
 +�
bsl-language-serverMissingParameterDescription�Необходимо удалить описания параметров "Нет", отсутствующих в сигнатуре метода2OO �
bsl-language-server
LineLength^Длина строки 136 превышает максимально допустимую 1202SS ��
bsl-language-server
LineLength^Длина строки 137 превышает максимально допустимую 1202WW �