�
bsl-language-serverCodeOutOfRegion/Переместите код в область2 :
? +1:
?[[ +1�
bsl-language-serverPairingBrokenTransaction�Отсутствует парный вызов "ОтменитьТранзакцию" для метода "НачатьТранзакцию"2 �
bsl-language-serverBeginTransactionBeforeTryCatch�Метод 'НачатьТранзакцию' должен быть за пределами блока 'Попытка-Исключение' непосредственно перед оператором 'Попытка'2 �
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 
bsl-language-serverInvalidCharacterInFileHНужно исправить на правильный символ "-"2UU ,�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "3" и используйте эту константу вместо магического числа.2((! "�
bsl-language-serverSetPrivilegedModeWПроверьте установку привилегированного режима2		 !�
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2[[ u
bsl-language-serverMissingSpaceFСлева и справа от '=' не хватает пробела2 u
bsl-language-serverMissingSpaceFСлева и справа от '=' не хватает пробела2 �
bsl-language-server CommitTransactionOutsideTryCatch�Метод 'ЗафиксироватьТранзакцию' должен идти последним в блоке 'Попытка' перед оператором 'Исключение'2&& �
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров266( +�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2@@A D�
bsl-language-serverCommonModuleNameServerCalldДобавьте постфикс "ВызовСервера" к имени общего модуля2 �
bsl-language-server
LineLength^Длина строки 170 превышает максимально допустимую 1202 �