�
bsl-language-serverCanonicalSpellingKeywordsOКлючевое слово "из" написано не канонически2kk �
bsl-language-serverCodeOutOfRegion/Переместите код в область2 ':
c '+1:
c
 +1:
c>> <+1:
cDD
 +1:
cJJ
 %+1:
cPP
 +1:
c[[
 +1:
cbb +1:
cgg
 -+1:
ctt
 +1:
czz
 (+1:
c '+1:
c
��
 +1:
c
��
 )+1:
c
��
 &+1:
c
��
  +1:
c
��
 +1:
c
��
 +1:
c
��
 )+1:
c
��
 &+1�
bsl-language-server,TransferringParametersBetweenClientAndServer�Установите модификатор "Знач" для параметра ПочтовыйЯщик метода СоздатьПочтовыйЯщик2tt *:
c
�� +1�
bsl-language-serverUsingThisForm�Вместо устаревшего свойства "ЭтаФорма" следует использовать "ЭтотОбъект"2-- 
�
bsl-language-serverJoinWithSubQuerylНе следует использовать соединения с вложенными запросами2	 2b
bsl-language-serverTypo;Возможная опечатка в "Интеренет"2!! (b
bsl-language-serverTypo;Возможная опечатка в "Интеренет"2>> <b
bsl-language-serverTypo;Возможная опечатка в "Интеренет"2?? '�
bsl-language-serverDeletingCollectionItem�Не следует удалять элементы коллекции "ЭлементыОтбора" при ее обходе оператором "Для каждого ... Из ... Цикл"2
�� (�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2oo 
�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "2" и используйте эту константу вместо магического числа.2   �
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "3" и используйте эту константу вместо магического числа.211! "�
bsl-language-serverNestedFunctionInParameters�Уберите инициализацию параметров метода "ПоказатьОповещениеПользователя" вложенными методами255  �
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2pp g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2??W Xg
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2WW7 8i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��) *i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��* +i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��+ ,i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��, -i
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела2
��- .�
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2## �
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2$$ �
bsl-language-serverIncorrectLineBreak}Проверьте правильность переноса операндов, операторов и параметров2%% �
bsl-language-serverLatinAndCyrillicSymbolInWord�Нельзя использовать латинские и кириллические символы в одном идентификаторе2
��
 &