�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :

 +1:
..
 +1:
33
 +1:
::
 +1�
bsl-language-serverAssignAliasFieldsInQuery�Полю "ВзаиморасчетыОстатки.Контрагент" не назначен псевдоним или пропущено ключевое слово КАК2 8�
bsl-language-serverAssignAliasFieldsInQuery�Полю "ВзаиморасчетыОстатки.Валюта" не назначен псевдоним или пропущено ключевое слово КАК2		 4�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2')�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2+,�
bsl-language-serverSemicolonPresencePПропущена точка с запятой в конце выражения2&& g
bsl-language-serverMissingSpace8Справа от ',' не хватает пробела244 �
bsl-language-server!VirtualTableCallWithoutParametersnНе следует использовать виртуальные таблицы без параметров2 @