s
bsl-language-serverCommonModuleInvalidType;Общий модуль недопустимого типа2 I�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
D
 +1:
D
 +1:
D##
 +1�
bsl-language-serverCommonModuleMissingAPI�Общий модуль должен иметь хотя бы один экспортный метод, а также область "ПрограммныйИнтерфейс" или "СлужебныйПрограммныйИнтерфейс".2 I�
bsl-language-serverMagicNumber�Создайте константу с понятным названием, присвойте ей значение "3" и используйте эту константу вместо магического числа.2" #�
bsl-language-serverNestedFunctionInParameters�Уберите инициализацию параметров метода "ПоказатьОповещениеПользователя" вложенными методами2  �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2
 �
bsl-language-serverMissingParameterDescriptionaНеобходимо добавить описание всех параметров метода2##
 