�
bsl-language-serverCodeOutOfRegion/Переместите код в область2


 !:
g


 !+1:
g
 +1:
g
 +1:
g((
 +1:
g00
 .+1�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2%&�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2DE