�
bsl-language-serverCodeOutOfRegion/Переместите код в область2
 :
1
 +1:
1
 +1:
1
 +1:
1&&
 $+1:
1--
 =+1:
144
 !+1:
1@@
 +1�
bsl-language-serverDeprecatedMessage_Не следует использовать устаревший метод "Сообщить"2 
�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2=>�
bsl-language-serverConsecutiveEmptyLinesVУдалите лишние последовательные пустые строки2EF�
bsl-language-server
LineLength^Длина строки 140 превышает максимально допустимую 1202:: �